 ### Pandas- DataFrame and Series

 Pandas is a powerful data manipulation library in Python , widely used for data analysis and data cleaning. It provides two primary data structures : Series and Data Frame. A series is a One dimensional array- like object, while a DataFrame is a 2D, size-mutable and potentially heterogenous tabular data structure with labelled axes(rows and columns)

In [3]:
import pandas as pd

In [5]:
##Series
#A one-dimensional labeled array capable of holding any data type (integers, strings, floats, Python objects, etc.).

import pandas as pd
data=[1,2,3,4,5]
series=pd.Series(data)
print("Series \n", series)
print(type(series))

Series
 0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [6]:
##Create a Series from Dictionary

data={'a':1,'b':2,'c':3}
series_dict=pd.Series(data)
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [10]:
data=[10,20,30]
indx=['a','b','c']
print(pd.Series(data,index=indx))

a    10
b    20
c    30
dtype: int64

In [13]:
marks = pd.Series([85, 90, 95], index=["Math", "Physics", "Chemistry"])
print(marks)

Math         85
Physics      90
Chemistry    95
dtype: int64

In [4]:
##Data Frames
## Create a data fram from a dictionary of list

data1 = {
    'name':['Suraj','John','Krish'],
    'Age':[22,25,30],
    'City':['Bangalore','NewYork','FLorida']
}
df=pd.DataFrame(data1)
print(df)
print(type(df))

    name  Age       City
0  Suraj   22  Bangalore
1   John   25    NewYork
2  Krish   30    FLorida
<class 'pandas.core.frame.DataFrame'>

In [18]:
import numpy as np
np.array(df)

array([['Suraj', 22, 'Bangalore'],
       ['John', 25, 'NewYork'],
       ['Krish', 30, 'FLorida']], dtype=object)

In [71]:
import pandas as pd
##Create a dataframe a list of Dictionaries
data = [
    {'name':'Suraj','Age':22,'City': 'Bangalore'},
    {'name':'Krish','Age':32,'City': 'Florida'},
    {'name':'John','Age':36,'City': 'California'},
    {'name':'Om','Age':14,'City': 'Delhi'}
]
df=pd.DataFrame(data)
print(df)

    name  Age        City
0  Suraj   22   Bangalore
1  Krish   32     Florida
2   John   36  California
3     Om   14       Delhi

In [ ]:
d1=pd.read_csv('employment.csv')
d1.head(5) ##top 5 records
#d1.tail(5) --> check the last 5 records

,Series_reference,Period,Data_value,Suppressed,STATUS,UNITS,Magnitude,Subject,Group,Series_title_1,Series_title_2,Series_title_3,Series_title_4,Series_title_5
0,BDCQ.SEA1AA,2011.06,80078.0,NaN,F,Number,0,Business Data Collection - BDC,Industry by employment variable,Filled jobs,"Agriculture, Forestry and Fishing",Actual,NaN,NaN
1,BDCQ.SEA1AA,2011.09,78324.0,NaN,F,Number,0,Business Data Collection - BDC,Industry by employment variable,Filled jobs,"Agriculture, Forestry and Fishing",Actual,NaN,NaN
2,BDCQ.SEA1AA,2011.12,85850.0,NaN,F,Number,0,Business Data Collection - BDC,Industry by employment variable,Filled jobs,"Agriculture, Forestry and Fishing",Actual,NaN,NaN
3,BDCQ.SEA1AA,2012.03,90743.0,NaN,F,Number,0,Business Data Collection - BDC,Industry by employment variable,Filled jobs,"Agriculture, Forestry and Fishing",Actual,NaN,NaN
4,BDCQ.SEA1AA,2012.06,81780.0,NaN,F,Number,0,Business Data Collection - BDC,Industry by employment variable,Filled jobs,"Agriculture, Forestry and Fishing",Actual,NaN,NaN

In [72]:
##Accesing data from data frame
df

    name  Age        City
0  Suraj   22   Bangalore
1  Krish   32     Florida
2   John   36  California
3     Om   14       Delhi

In [73]:
df['name'] ##--> so it has become basically Series

0    Suraj
1    Krish
2     John
3       Om
Name: name, dtype: object

In [74]:
df.loc[1] ##use .loc[] when you want to access rows and columns by their names/labels.

name      Krish
Age          32
City    Florida
Name: 1, dtype: object

In [ ]:
df.iloc[2] ## use .iloc[] when you want to access rows and columns by their integer positions (like regular Python lists).

name          John
Age             36
City    California
Name: 2, dtype: object

In [30]:
print(df.loc[0][0])
print(df.loc[1][2])

Suraj
Florida

C:\Users\suraj\AppData\Local\Temp\ipykernel_26596\1036856033.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(df.loc[0][0])
C:\Users\suraj\AppData\Local\Temp\ipykernel_26596\1036856033.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(df.loc[1][2])

In [75]:
df

    name  Age        City
0  Suraj   22   Bangalore
1  Krish   32     Florida
2   John   36  California
3     Om   14       Delhi

In [37]:
##Accesing a specified element
print(df.at[0,'Age'])
print(df.at[1,'name'])

22
Krish

In [38]:
##Accesing a specified element using iat
df.iat[2,2]

'California'

In [67]:
##Data manipulation with Data Frames
df

    name  Age       City
0  Suraj   28  Bangalore
3     Om   20      Delhi

In [76]:
df['Salary']=[40000,60000,700000,430000]
df

    name  Age        City  Salary
0  Suraj   22   Bangalore   40000
1  Krish   32     Florida   60000
2   John   36  California  700000
3     Om   14       Delhi  430000

In [77]:
##Remove a column
df.drop('Salary',axis=1,inplace=True) ##default axis =0 which is row --> it will check in the rows if there is salary
                                      ##inplace=True --> this is written becoz dropping the column is just temporay. To permanently delete it; use inplace
df

    name  Age        City
0  Suraj   22   Bangalore
1  Krish   32     Florida
2   John   36  California
3     Om   14       Delhi

In [60]:
##add age to the column
df['Age']=df['Age']+1 ##increments the value of Age by +1
df

    name  Age       City
0  Suraj   28  Bangalore
1  Krish   38    Florida
3     Om   20      Delhi

In [79]:
d1=pd.read_csv('employment.csv')
d1.head(4)

,Series_reference,Period,Data_value,Suppressed,STATUS,UNITS,Magnitude,Subject,Group,Series_title_1,Series_title_2,Series_title_3,Series_title_4,Series_title_5
0,BDCQ.SEA1AA,2011.06,80078.0,NaN,F,Number,0,Business Data Collection - BDC,Industry by employment variable,Filled jobs,"Agriculture, Forestry and Fishing",Actual,NaN,NaN
1,BDCQ.SEA1AA,2011.09,78324.0,NaN,F,Number,0,Business Data Collection - BDC,Industry by employment variable,Filled jobs,"Agriculture, Forestry and Fishing",Actual,NaN,NaN
2,BDCQ.SEA1AA,2011.12,85850.0,NaN,F,Number,0,Business Data Collection - BDC,Industry by employment variable,Filled jobs,"Agriculture, Forestry and Fishing",Actual,NaN,NaN
3,BDCQ.SEA1AA,2012.03,90743.0,NaN,F,Number,0,Business Data Collection - BDC,Industry by employment variable,Filled jobs,"Agriculture, Forestry and Fishing",Actual,NaN,NaN

In [84]:
##display the data types of each column
print("Data types : \n", d1.dtypes)

##describe the dataFrame
print("Statistical Summary :\n",d1.describe())

Data types :
 Series_reference     object
Period              float64
Data_value          float64
Suppressed           object
STATUS               object
UNITS                object
Magnitude             int64
Subject              object
Group                object
Series_title_1       object
Series_title_2       object
Series_title_3       object
Series_title_4      float64
Series_title_5      float64
dtype: object
Statistical Summary :
              Period    Data_value     Magnitude  Series_title_4  \
count  24511.000000  2.167200e+04  24511.000000             0.0
mean    2017.576132  7.342422e+04      2.277753             NaN
std        3.987928  2.125253e+05      2.911822             NaN
min     2011.060000  1.171797e+00      0.000000             NaN
25%     2014.090000  1.919150e+03      0.000000             NaN
50%     2017.120000  1.417900e+04      0.000000             NaN
75%     2021.060000  6.088450e+04      6.000000             NaN
max     2025.030000  2.321295e+06      6.000000             NaN

       Series_title_5
count             0.0
mean              NaN
std               NaN
min               NaN
25%               NaN
50%               NaN
75%               NaN
max               NaN

In [85]:
print(d1.describe)

<bound method NDFrame.describe of       Series_reference   Period  Data_value Suppressed STATUS   UNITS  \
0          BDCQ.SEA1AA  2011.06     80078.0        NaN      F  Number
1          BDCQ.SEA1AA  2011.09     78324.0        NaN      F  Number
2          BDCQ.SEA1AA  2011.12     85850.0        NaN      F  Number
3          BDCQ.SEA1AA  2012.03     90743.0        NaN      F  Number
4          BDCQ.SEA1AA  2012.06     81780.0        NaN      F  Number
...                ...      ...         ...        ...    ...     ...
24506    BDCQ.SEE3999A  2017.06         NaN          Y      F  Number
24507    BDCQ.SEE3999A  2017.09         NaN          Y      F  Number
24508    BDCQ.SEE3999A  2017.12         NaN          Y      F  Number
24509    BDCQ.SEE3999A  2018.03         NaN          Y      F  Number
24510    BDCQ.SEE3999A  2018.06         NaN          Y      F  Number

       Magnitude                         Subject  \
0              0  Business Data Collection - BDC
1              0  Business Data Collection - BDC
2              0  Business Data Collection - BDC
3              0  Business Data Collection - BDC
4              0  Business Data Collection - BDC
...          ...                             ...
24506          0  Business Data Collection - BDC
24507          0  Business Data Collection - BDC
24508          0  Business Data Collection - BDC
24509          0  Business Data Collection - BDC
24510          0  Business Data Collection - BDC

                                              Group  \
0                   Industry by employment variable
1                   Industry by employment variable
2                   Industry by employment variable
3                   Industry by employment variable
4                   Industry by employment variable
...                                             ...
24506  Territorial authority by employment variable
24507  Territorial authority by employment variable
24508  Territorial authority by employment variable
24509  Territorial authority by employment variable
24510  Territorial authority by employment variable

                               Series_title_1  \
0                                 Filled jobs
1                                 Filled jobs
2                                 Filled jobs
3                                 Filled jobs
4                                 Filled jobs
...                                       ...
24506  Filled jobs (workplace location based)
24507  Filled jobs (workplace location based)
24508  Filled jobs (workplace location based)
24509  Filled jobs (workplace location based)
24510  Filled jobs (workplace location based)

                           Series_title_2 Series_title_3  Series_title_4  \
0       Agriculture, Forestry and Fishing         Actual             NaN
1       Agriculture, Forestry and Fishing         Actual             NaN
2       Agriculture, Forestry and Fishing         Actual             NaN
3       Agriculture, Forestry and Fishing         Actual             NaN
4       Agriculture, Forestry and Fishing         Actual             NaN
...                                   ...            ...             ...
24506  Area Outside Territorial Authority         Actual             NaN
24507  Area Outside Territorial Authority         Actual             NaN
24508  Area Outside Territorial Authority         Actual             NaN
24509  Area Outside Territorial Authority         Actual             NaN
24510  Area Outside Territorial Authority         Actual             NaN

       Series_title_5
0                 NaN
1                 NaN
2                 NaN
3                 NaN
4                 NaN
...               ...
24506             NaN
24507             NaN
24508             NaN
24509             NaN
24510             NaN

[24511 rows x 14 columns]>